tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
# Tool for reverse engineering 3rd party, closed, binary Android apps
brew "apktool"
# Shell extension to jump to frequently used directories
brew "autojump"
# Bastard Tetris
brew "bastet"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU binary tools for native development
brew "binutils"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Searches a binary image for embedded files and executable code
brew "binwalk"
# Console-based live network and disk I/O bandwidth monitor
brew "bwm-ng"
# Like cat but displays content with syntax highlighting
brew "ccat"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Reimplementation of ctags(1)
brew "ctags"
# Tools to work with Android .dex and Java .class files
brew "dex2jar"
# Debian package management system
brew "dpkg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Command-line fuzzy finder written in Go
brew "fzf"
# Nonsense activity generator
brew "genact"
# Library and utilities for processing GIFs
brew "giflib"
# Alternative to top/htop
brew "glances"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# GUI toolkit
brew "gtk+"
# View and edit files in hexadecimal or ASCII
brew "hexedit"
# Viewer/editor/analyzer for executables
brew "ht"
# Improved top (interactive process viewer)
brew "htop"
# Add GitHub support to git on the command-line
brew "hub"
# Improved colored diff
brew "icdiff"
# Tool to measure maximum TCP and UDP bandwidth
brew "iperf"
# Lightweight and flexible command-line JSON processor
brew "jq"
# C websockets server library
brew "libwebsockets"
# Rainbows and unicorns in your console!
brew "lolcat"
# CLI for Apple's Private (Closed) Mobile Device Framework
brew "mobiledevice"
# Remote terminal application
brew "mosh"
# CLI for MySQL with auto-completion and syntax highlighting
brew "mycli"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Classic snake game with textual interface
brew "nsnake"
# Library and executable for using citeproc with pandoc
brew "pandoc-citeproc"
# Show ps output as a tree
brew "pstree"
# Monitor data's progress through a pipe
brew "pv"
# Reverse engineering framework
brew "radare2"
# Move files to macOS's Trash
brew "rmtrash"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Code-search similar to ack
brew "the_silver_searcher"
# Programatically correct mistyped console commands
brew "thefuck"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extract, view, and test RAR archives
brew "unrar"
# USB multiplexor daemon for iPhone and iPod Touch devices
brew "usbmuxd"
# Visual Binary Diff
brew "vbindiff"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Dumb downloader that scrapes the web
brew "you-get"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Zsh port of Fish shell's history search
brew "zsh-history-substring-search"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
cask "alfred"
cask "cathode"
cask "font-sourcecodepro-nerd-font"
cask "gray"
cask "impactor"
cask "insomniax"
cask "iterm2"
cask "macmediakeyforwarder"
cask "omnifocus"
cask "popclip"
cask "qq"
cask "spectacle"
cask "spotify"
cask "spotify-notifications"
cask "squirrel"
cask "steam"
cask "sublime-text"
cask "telegram"
cask "tweeten"
cask "visual-studio-code"
cask "vnc-viewer"
cask "xampp"
